# opening

# CSV存在確認

# 存在しない場合

#CSVファイル作成


#CSVファイルが存在する場合
    # CSVファイル内データ確認

    # データが存在する場合
        # 投票数の多い順にデータをソートする

        #CSVファイル読込

        # 存在するデータの行数分ループを行う

            # オススメのレストランを紹介して好きか嫌いかを尋ねる
                #オススメのレストランが好きな場合　
                #csvのレストラン名にカウントを追加

            #　オススメのレストランが嫌いな場合
                #リスト内の別のレストランを紹介する
                #リスト内の全てのレストランを紹介する

        #存在するデータの行数分ループを抜ける

        # 好きなレストランを質問する

        # CSV書き込み



    # データが存在しない場合

    # 好きなレストランを質問する

    # CSV書き込み


# closing